teste5/app/Controllers/Usuarios.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = 9994
---
    private function buscaUsuarioOu404(int $id = null)
    {

        // Se eu não consegui encontrar o usuário eu jogo uma mensagem de erro
        if(!$id || !$usuario = $this->usuarioModel->withDeleted(true)->find($id)){